In [1]:
a = 7 
b = 6
a + b

13

In [2]:
import pandas as pd
import numpy as np 
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago'],
    'Salary': [70000, 80000, 90000]
}
df = pd.DataFrame(data)
df

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [3]:
# Concatenation and Merging
df1 = pd.DataFrame({    'Name': ['David', 'Eva'],
    'Age': [28, 32],
    'City': ['New York', 'London']})
df2 = pd.DataFrame({    'Name': ['Frank', 'Grace'],
    'Age': [29, 31],
    'City': ['Paris', 'Tokyo']})
df_concat = pd.concat([df1, df2], ignore_index=True)  # Concatenate DataFrames vertically
df_concat

    Name  Age      City
0  David   28  New York
1    Eva   32    London
2  Frank   29     Paris
3  Grace   31     Tokyo